src/test/xmlstilling.wsdl

<?xml version="1.0" encoding="ISO-8859-1"?>

<definitions xmlns = "http://schemas.xmlsoap.org/wsdl/" 
        xmlns:soap = "http://schemas.xmlsoap.org/wsdl/soap/" 
        xmlns:http = "http://schemas.xmlsoap.org/wsdl/http/" 
          xmlns:xs = "http://www.w3.org/2001/XMLSchema" 
     xmlns:soapenc = "http://schemas.xmlsoap.org/soap/encoding/" 
         xmlns:ns1 = "http://www.nav.no/nav_stilling_reg.wsdl" 
         xmlns:ns2 = "http://www.nav.no/nav_stilling_typer.xsd" 
   targetNamespace = "http://www.nav.no/nav_stilling_reg.wsdl">

  <types>
    <xs:schema>
      <xs:import namespace="http://www.nav.no/nav_stilling_typer.xsd" schemaLocation="./xsd/nav_stilling_typer.xsd"/>
    </xs:schema>
  </types>

  <message name="LeggInnStillingerIn">
    <part name="StillingListe" type="ns2:StillingListeType"/>
  </message>

  <message name="LeggInnStillingerOut">
    <part name="Id" type="ns2:SvarType"/>
  </message>

  <portType name="NavEksterneStillingerPortType">
    <operation name="LeggInnStillinger">
      <input message="ns1:LeggInnStillingerIn"/>
      <output message="ns1:LeggInnStillingerOut"/>
    </operation>
  </portType>

  <binding name="NavEksterneStillingerBinding" type="ns1:NavEksterneStillingerPortType">
    <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>

    <operation name="LeggInnStillinger">
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>

  <service name="NavEksterneStillingerService">
    <port name="NavEksterneStillingerPort" binding="ns1:NavEksterneStillingerBinding">
      <soap:address location="http://www.nav.no/eksternestillinger"/>
    </port>
  </service>
</definitions>

